tripster/app/controllers/trips_controller.rb

INSERT INTO "trips" ("created_at", "description", "ends_at", "name", "starts_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    trip_params = params[:trip]
    @trip = Trip.new
    @trip.user_id = current_user.id
    @trip.name = trip_params[:name]
    @trip.description = trip_params[:description]
    @trip.starts_at = DateTime.strptime(trip_params[:starts_at], "%m/%d/%Y")
    @trip.ends_at = DateTime.strptime(trip_params[:ends_at], "%m/%d/%Y")

     if @trip.save!

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1 ORDER BY "trips"."id" DESC LIMIT 1  [["user_id", 2]]
---
  def dashboard
    if current_user.trips.last