tripster/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 07 Jan 2014 00:46:13 UTC +00:00], ["email", "trippytripster@example.com"], ["name", "The Trippiest"], ["updated_at", Tue, 07 Jan 2014 00:46:13 UTC +00:00]]
---
  def create
    @user = User.new
    @user.name = params[:user][:name]
    @user.email = params[:user][:email]
    @user.save